tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'heroku/brew'
tap 'derailed/k9s'

brew "ansible"
brew "aws-iam-authenticator"
brew "awscli"
brew "awslogs"
brew "brew-cask-completion"
brew "derailed/k9s/k9s"
brew "direnv"
brew "docker-completion"
brew "docker-compose-completion"
brew "fish"
brew "git"
brew "go"
brew "helm"
brew "heroku"
brew "hub"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "pyenv-virtualenv"
brew "pyenv"
brew "rbenv"
brew "terraform"
brew "thefuck"
brew "vault"
brew "youtube-dl"
brew "zplug"
brew "zsh-history-substring-search"
brew "stripe/stripe-cli/stripe"

# Essentials
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "microsoft-edge"
cask "microsoft-office"
cask "slack"
cask "transmit"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "dropbox"
cask "textexpander"

# Design
cask "adobe-creative-cloud"
cask "monodraw"
cask "skyfonts"

# Development
cask "dash"
cask "datagrip"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "kaleidoscope"
cask "monodraw"
cask "ngrok"
cask "paw"
cask "postman"
cask "tower"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex"
cask "font-jetbrains-mono"

# Mac App Store
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "Agenda.", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Cascadea", id: 1432182561
mas "Core Tunnel", id: 1354318707
mas "Deliveries", id: 924726344
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pastebot", id: 1179623856
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Reeder 5", id: 1529448980
mas "Slack", id: 803453959
mas "System Designer", id: 1102494854
mas "Things", id: 904280696
