tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap heroku/brew

brew "aws-iam-authenticator"
brew "awscli"
brew "awslogs"
brew "brew-cask-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker"
brew "fish"
brew "git"
brew "hub"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "rbenv"
brew "terraform"
brew "thefuck"
brew "vault"
brew "youtube-dl"
brew "heroku"

# Essentials
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "slack"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "dropbox"
cask "keybase"
cask "textexpander"

# Design
cask "adobe-creative-cloud"

# Development
cask "dash"
cask "datagrip"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "kaleidoscope"
cask "paw"
cask "postman"
cask "tower"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-hack"

# Mac App Store
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "CardHop", id: 1290358394
mas "Core Tunnel", id: 1354318707
mas "Deliveries", id: 924726344
mas "Fantastical 2", id: 975937182
mas "Keynote", id: 409183694
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Paprika", id: 1303222628
mas "Pastebot", id: 1179623856
mas "PiPifier", id: 1160374471
mas "Reeder 4", id: 1449412482
# mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "System Designer", id: 1102494854
