tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

brew "awscli"
brew "awslogs"
brew "brew-cask-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "fish"
brew "git"
brew "hub"
brew "jq"
brew "kubectl"
brew "mas"
brew "node"
brew "rbenv"
brew "thefuck"
brew "vault"
brew "youtube-dl"

# Essentials
cask "caffeine"
cask "firefox"
cask "google-chrome"
cask "vlc"
cask "spotify"
cask "gpg-suite"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "docker"
cask "dropbox"
cask "keybase"
cask "textexpander"
cask "viscosity"
cask "vnc-viewer"

# Design
cask "adobe-creative-cloud"
cask "sketch"

# Development
cask "atom"
cask "dash"
cask "datagrip"
cask "intellij-idea"
cask "iterm2"
cask "kaleidoscope"
cask "paw"
cask "postman"
cask "tower"

# Fonts
cask "font-fira-code"
cask "font-hack"

# Mac App Store
mas "1Blocker", id: 1107421413
mas "1Password", id: 443987910
mas "Bear", id: 1091189122
mas "Deliveries", id: 924726344
mas "Fantastical 2", id: 975937182
mas "Keynote", id: 409183694
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "PiPifier", id: 1160374471
mas "Reeder", id: 880001334
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "SSH Tunnel", id: 734418810
mas "Things3", id: 904280696
mas "CardHop", id: 1290358394
