tap "abyss/tools"
tap "aws/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "spacelift-io/spacelift"
tap "warrensbox/tap"
brew "aider"
brew "ansible"
brew "awscli"
brew "bat"
brew "brew-cask-completion"
brew "deno"
brew "direnv"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "grizzly"
brew "grype"
brew "helm"
brew "hub"
brew "jq"
brew "jsonnet-bundler"
brew "just"
brew "k6"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "logcli"
brew "mas"
brew "mimirtool"
brew "mkcert"
brew "node"
brew "opentofu"
brew "pandoc"
brew "pinentry-mac"
brew "pnpm"
brew "pwgen"
brew "pyenv"
brew "ripgrep"
brew "spaceship"
brew "sslscan"
brew "stow"
brew "tokei"
brew "uutils-coreutils"
brew "uv"
brew "xh"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zplug"
brew "abyss/tools/awsp"
brew "aws/tap/ec2-instance-selector"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "spacelift-io/spacelift/spacectl"
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "claude"
cask "dash"
cask "datagrip"
cask "discord"
cask "dropbox"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "ghostty"
cask "git-credential-manager"
# cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "iterm2"
cask "kaleidoscope"
# cask "microsoft-auto-update"
# cask "microsoft-edge"
# cask "microsoft-office"
# cask "miro"
cask "monodraw"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "readdle-spark"
cask "session-manager-plugin"
cask "setapp"
cask "slack"
cask "spotify"
cask "steam"
cask "textexpander"
cask "tower"
cask "transmit"
cask "viscosity"
cask "visual-studio-code"
cask "warp"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "American Airlines AAdvantage eShopping℠", id: 6479809449
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pastebot", id: 1179623856
mas "Things", id: 904280696
