tap 'homebrew/cask-fonts'
tap 'derailed/k9s'

brew "awscli"
brew "brew-cask-completion"
brew "derailed/k9s/k9s"
brew "direnv"
brew "git"
brew "helm"
brew "hub"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "pyenv"
brew "spaceship"
brew "stow"
brew "terraform"
brew "vault"
brew "yt-dlp"
brew "zoxide"
brew "zplug"

# Essentials
cask "1password"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "microsoft-edge"
cask "microsoft-office"
cask "obsidian"
cask "slack"
cask "transmit"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "dropbox"
cask "textexpander"

# Design
cask "monodraw"

# Development
cask "dash"
cask "datagrip"
cask "iterm2"
cask "kaleidoscope"
cask "monodraw"
cask "orbstack"
cask "postman"
cask "tower"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-monaspace"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Things", id: 904280696
